In [ ]:
!pip install mysql-connector-python

In [ ]:
import mysql.connector

connection = mysql.connector.connect(
    host="127.0.0.1",
    user="root",
    password="      ",
    database="preday48")
cursor = connection.cursor()

In [ ]:
import pandas as pd

In [ ]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS customers(
    id INT PRIMARY KEY,
    name VARCHAR(100),
    city VARCHAR(100)
) ENGINE=InnoDB;
""")

In [ ]:
cursor.execute("""
INSERT INTO customers VALUES
    (1, 'Alice', 'Hanoi'),
    (2, 'Bob', 'Ho Chi Minh'),
    (3, 'Charlie', 'Hanoi')
;
""")
connection.commit()

In [ ]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS orders(
    id INT PRIMARY KEY,
    customer_id INT,
    order_date DATE,
    total INT
)ENGINE=InnoDB;
""")

In [ ]:
cursor.execute("""
INSERT INTO orders VALUES
    (1, 1, '2024-01-10', 500),
    (2, 1, '2024-03-01', 800),
    (3, 2, '2024-02-20', 1200),
    (4, 3, '2024-01-15', 200)
;
""")
connection.commit()

In [ ]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS products(
    id INT PRIMARY KEY,
    name VARCHAR(100),
    price INT
)ENGINE=InnoDB;
""")

In [ ]:
cursor.execute("""
INSERT INTO products VALUES
    (1, 'Laptop', 1500),
    (2, 'Mouse', 50),
    (3, 'Keyboard', 100),
    (4, 'Monitor', 300)
;
""")
connection.commit()

In [ ]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS order_items(
    id INT PRIMARY KEY,
    order_id INT,
    product_id INT,
    quantity INT
)ENGINE=InnoDB;
""")

In [ ]:
cursor.execute("""
INSERT INTO order_items VALUES
    (1, 1, 2, 2),
    (2, 1, 3, 1),
    (3, 2, 1, 1),
    (4, 2, 4, 1),
    (5, 3, 1, 1)
;
""")
connection.commit()

In [ ]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS employees(
    id INT PRIMARY KEY,
    name VARCHAR(100),
    department VARCHAR(100)
)ENGINE=InnoDB;
""")

In [ ]:
cursor.execute("""
INSERT INTO employees VALUES
    (1, 'David', 'Sales'),
    (2, 'Emma', 'Support'),
    (3, 'Frank', 'Sales')
;
""")
connection.commit()

In [ ]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS order_assignments(
    id INT PRIMARY KEY,
    order_id INT,
    employee_id INT
)ENGINE=InnoDB;
""")

In [ ]:
cursor.execute("""
INSERT INTO order_assignments VALUES
    (1, 1, 1),
    (2, 2, 3),
    (3, 3, 2)
;
""")
connection.commit()

In [ ]:
# Tìm tất cả khách hàng đã từng mua đơn hàng chứa sản phẩm có giá lớn hơn 1000
query="""
SELECT DISTINCT c.name
FROM customers c
JOIN orders o ON c.id= o.customer_id
WHERE o.id IN(
    SELECT oi.order_id
    FROM order_items oi
    JOIN products p ON oi.product_id = p.id
    WHERE p.price > 1000)
;
"""
connection.commit()
data=pd.read_sql_query(query,connection)
data

In [ ]:
# Liệt kê tên từng khách hàng và tổng giá trị tất cả đơn hàng mà họ đã đặt
query="""
SELECT c.name,
    (SELECT SUM(total)
    FROM orders o
    WHERE o.customer_id= c.id) AS total_spent
FROM customers c
;
"""
connection.commit()
data=pd.read_sql_query(query,connection)
data

In [ ]:
# Hiển thị top 2 khách hàng có tổng chi tiêu cao nhất (dựa trên cột total của đơn hàng)
query="""
SELECT name, total_spent
FROM (
    SELECT c.name, sum(o.total) AS total_spent
    FROM customers c
    JOIN orders o ON c.id = o.customer_id
    GROUP BY c.name
) AS spending
ORDER BY total_spent DESC
LIMIT 2
;
"""
connection.commit()
data=pd.read_sql_query(query,connection)
data

In [ ]:
# Tìm tên nhân viên thuộc phòng Sales đã từng xử lý đơn hàng có chứa sản phẩm tên "Monitor"
query="""
SELECT DISTINCT e.name
FROM employees e
WHERE e.department = 'Sales'
AND EXISTS(
    SELECT 1
    FROM order_assignments oa
    JOIN order_items oi ON oi.order_id = oa.order_id
    JOIN products p ON p.id = oi.product_id
    WHERE p.name = 'Monitor'
    AND oa.employee_id = e.id )
;
"""
connection.commit()
data=pd.read_sql_query(query,connection)
data

In [ ]:
# Tìm các khách hàng có tổng chi tiêu cao hơn mức trung bình của tất cả khách hàng
query="""
SELECT c.name, SUM(o.total) AS total_spent
FROM customers c
JOIN orders o ON c.id = o.customer_id
GROUP BY c.name
HAVING SUM(o.total) > (
    SELECT AVG(customer_total)
    FROM (
        SELECT customer_id, SUM(total) AS customer_total
        FROM orders
        GROUP BY customer_id
    ) AS avg_spent
);
"""
connection.commit()
data=pd.read_sql_query(query,connection)
data

In [ ]:
# Tạo bảng tạm vip_customers gồm những khách hàng có tổng giá trị đơn hàng lớn hơn 1000.
# Sau đó, hiển thị tên và tổng chi tiêu của các khách hàng trong bảng tạm này.

query="""
CREATE TEMPORARY TABLE IF NOT EXISTS vip_customers AS
SELECT customer_id, SUM(total) AS total_spent
FROM orders
GROUP BY customer_id
HAVING SUM(total) > 1000
;
"""
cursor.execute(query)

In [ ]:
query="""
SELECT c.name, v.total_spent
FROM customers c
JOIN vip_customers v ON c.id = v.customer_id
;"""
connection.commit()
data=pd.read_sql_query(query,connection)
data

In [ ]:
# Tạo bảng tạm popular_products gồm những sản phẩm được bán ra với tổng số lượng từ 2 trở lên
# Hiển thị tên và tổng số lượng bán ra của các sản phẩm này
query="""
CREATE TEMPORARY TABLE IF NOT EXISTS popular_products AS
SELECT product_id, SUM(quantity) AS total_quantity
FROM order_items
GROUP BY product_id
HAVING SUM(quantity) >=2
;"""
cursor.execute(query)

In [ ]:
query="""
SELECT p.name, pp.total_quantity
FROM products p
JOIN popular_products pp ON pp.product_id = p.id
;"""
connection.commit()
data=pd.read_sql_query(query,connection)
data

In [ ]:
# Liệt kê tên các khách hàng có đơn hàng được xử lý bởi nhân viên có tổng doanh số lớn hơn 1000
query="""SELECT c.name
FROM customers c
WHERE EXISTS (
    SELECT 1
    FROM orders o
    JOIN order_assignments oa ON o.id = oa.order_id
    WHERE o.customer_id = c.id
    AND oa.employee_id IN (
        SELECT oa.employee_id
        FROM order_assignments oa
        JOIN orders o ON oa.order_id = o.id
        GROUP BY oa.employee_id
        HAVING SUM(o.total) > 1000
)
);"""
connection.commit()
data=pd.read_sql_query(query,connection)
data

In [ ]:
query="""
SELECT DISTINCT c.name
FROM customers c
JOIN orders o ON o.customer_id = c.id
JOIN order_assignments oa ON oa.order_id = o.id
WHERE oa.employee_id IN (
    SELECT employee_id
    FROM (
        SELECT e.id AS employee_id, SUM(o.total) AS total_sales
        FROM employees e
        JOIN order_assignments oa ON e.id = oa.employee_id
        JOIN orders o ON o.id = oa.order_id
        GROUP BY e.id
        HAVING SUM(o.total) > 1000
    ) AS top_sellers
);"""
connection.commit()
data=pd.read_sql_query(query,connection)
data

In [ ]:
query="""
SELECT DISTINCT c.name
FROM customers c
JOIN orders o ON c.id = o.customer_id
JOIN order_assignments oa ON o.id = oa.order_id
WHERE oa.employee_id IN(
    SELECT employee_id
    FROM (
        SELECT e.id AS employee_id, SUM(o.total) AS total_sales
        FROM employees e
        JOIN order_assignments oa ON oa.employee_id = e.id
        JOIN orders o ON o.id = oa.order_id
        GROUP BY e.id
        HAVING SUM(o.total) > 1000
    ) AS top_sellers


);"""
connection.commit()
data=pd.read_sql_query(query,connection)
data

In [ ]:
# Tạo bảng tạm high_value_orders gồm những đơn hàng có tổng tiền > 800
query="""
CREATE TEMPORARY TABLE IF NOT EXISTS high_value_orders AS
SELECT *
FROM orders
WHERE total >800
;"""
cursor.execute(query)

#Hiển thị tên khách hàng của các đơn hàng đó
query="""
SELECT c.name, hvo.total
FROM high_value_orders hvo
JOIN customers c ON c.id = hvo.customer_id
; """
connection.commit()
data=pd.read_sql_query(query,connection)
data

In [ ]:
# Tính tổng giá trị thực tế của từng đơn hàng bằng cách lấy price × quantity theo từng dòng sản phẩm
query="""
SELECT oi.order_id, SUM(p.price*oi.quantity) AS total_value_oi
FROM order_items oi
JOIN products p ON p.id = oi.product_id
GROUP BY oi.order_id
; """
connection.commit()
data=pd.read_sql_query(query,connection)
data